const handler = async (m, {conn, text, command}) => {
  let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
  let videoUrl = 'https://telegra.ph/file/b9a56ed7fc71221de0da5.mp4'
let str = ` *•┃❖اهلا بك في  قسـم لوغـو التلـ🎨ـوين*
*❖☾•═━═━═⊳•⊰🎨⊱•⊲═━═━═•☽❖*
*•┃❖🎨〗❰بالون3❱*
*•┃❖🎨〗❰بالون-وردي❱*
*•┃❖🎨〗❰بالون-اخضر❱*
*•┃❖🎨〗❰بالون-سماوي❱*
*•┃❖🎨〗❰بالون-ازرق❱*
*•┃❖🎨〗❰بالون-ذهب❱*
*•┃❖🎨〗❰زجاج-اصفر❱*
*•┃❖🎨〗❰زجاج-بنفسجي❱*
*•┃❖🎨〗❰زجاج-برتقالي❱*
*•┃❖🎨〗❰زجاج-اخضر❱*
*•┃❖🎨〗❰زجاج-ازرق❱*
*•┃❖🎨〗❰زجاج-سماوي❱*
*•┃❖🎨〗❰زجاج-احمر❱*
*•┃❖🎨〗❰زجاج-لامع❱*
*•┃❖🎨〗❰زجاج-ملون❱*
*•┃❖🎨〗❰فولاذ❱*
*•┃❖🎨〗❰لمعان❱*
*•┃❖🎨〗❰ازرق-غامق❱*
*•┃❖🎨〗❰تزين-اخضر❱*
*•┃❖🎨〗❰تزين-ارجواني❱*
*•┃❖🎨〗❰ذهب-وردي❱*
*•┃❖🎨〗❰ذهب-زرقاء❱*
*•┃❖🎨〗❰ذهب-خضراء❱*
*•┃❖🎨〗❰ذهب-ارجواني❱*
*•┃❖🎨〗❰ذهب-اصفر❱*
*•┃❖🎨〗❰ذهب-احمر❱*
*•┃❖🎨〗❰ذهب-سماوي❱*
*•┃❖🎨〗❰ذهب-بنفسجي❱*
*•┃❖🎨〗❰لغات-سماوي❱*
*•┃❖🎨〗❰لغات-اصفر❱*
*•┃❖🎨〗❰لغات-فضي❱*
*•┃❖🎨〗❰لغات-اخضر❱*
*•┃❖🎨〗❰لغات-وردي❱*
*•┃❖🎨〗❰لغات-ارجواني❱*
*•┃❖🎨〗❰لغات-ازرق❱*
*•┃❖🎨〗❰مجوهرات-زرقاء❱*
*•┃❖🎨〗❰مجوهرات-سماوي❱*
*•┃❖🎨〗❰مجوهرات-خضراء❱*
*•┃❖🎨〗❰مجوهرات-برتقالي❱*
*•┃❖🎨〗❰مجوهرات-ارجواني❱*
*•┃❖🎨〗❰مجوهرات-حمراء❱*
*•┃❖🎨〗❰مجوهرات-فضيه❱*
*•┃❖🎨〗❰مجوهرات-صفراء❱*
*•┃❖🎨〗❰جلد-ذهبي❱*
*•┃❖🎨〗❰زمرد❱*
*•┃❖🎨〗❰صخر❱*
*•┃❖🎨〗❰بركان❱*
*•┃❖🎨〗❰كابتن-امريكا❱*
*•┃❖🎨〗❰روبوت❱*
*•┃❖🎨〗❰قوس-معدل❱*
*•┃✰━━━━━⌬〔🎨〕⌬━━━━━✰*
*•┃⌬ حقـوق السيد لوفي✍︎* 
*•┃ا⌬ wa.me/967733707084*
*•┃ا⌬┋𝑴𝒐𝒏𝒌𝒆𝒚 𝑫 𝑳𝒖𝒇𝒇𝒚١⁵〖🐉〗*
*╰━━━━━━━━━━━━━━━━━━━━━⬣*`

  await conn.reply(m.chat, '*انتضر جاري تجهيز قائمه لوغو الالوان🎨..*', fkontak, { contextInfo:{ forwardingScore: 2022, isForwarded: true, externalAdReply: {title: '𝐿𝑈𝐹𝐹𝑌-𝐵𝛩𝑇', body: `【𝟐𝟎𝟎𝟓/𝟐/𝟏𝟎】١⁵`, sourceUrl: nn,thumbnail: '' }}})
    conn.sendMessage(m.chat, { 
        video: { url: videoUrl }, caption: str,
  mentions: [m.sender,global.conn.user.jid],
  gifPlayback: true,gifAttribution: 0
    }, { quoted: fkontak })
} 

handler.help = ['13']
handler.tags = ['13']
handler.command = /^(15)$/i
export default handler
