let handler = async (m, { command, text }) => m.reply(`*⋋❖┋نيفرلاند ترحب بكم🫂☾*
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*
*❖┋نرجوا ملئ الاستمارة لكى نضيفك للنقابة☾*
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*
*⋋❖👤┋اللقب⇇〘  〙*
*⋋❖🎞️┋من انمي⇇〘  〙*
*⋋❖👩🏻‍🤝‍👨🏻┋بنت ام ولد⇇〘  〙*
*⋋❖🧧┋من طرف⇇〘  〙*
*⋋❖🖼️┋صوره للشخصية⇇〘  〙*
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*
*⋋❖╎! مـلـحـوظة ☾*
*❖┋ممنوع بنت تاخذ لقب ولد او العكس ☾*
*❖┋لملئ الإستمارة يرجى النسخ وملء الفراغات☾*
*❖┋بعد ملئ الاستمارة منشن لاحد المشرفين☾*
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*
*⋋❖┋رابط القاب الاعضاء المستخدمه ☇☾*
*https://docs.google.com/spreadsheets/d/1FnsDvQWv7FJAV4_7q5MHvS-ActqpwkoprIYF7Gn-bGM/edit*
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*
*⋋❖┋توقيع الإدارة🖋️ ☾*
                       𝐍.𝐑.𝐃
*❖☾•═━═━═⊳•⊰🏮⊱•⊲═━═━═•☽❖*`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الاوامر <teks>?']
handler.tags = ['الاوامر', 'fun']
handler.command = /^(الاستماره|0|استماره|استماره|استمارة)$/i

export default handler
