const handler = async (m, {conn, text, command}) => {
  const yh = global.loli;
  const url = yh[Math.floor(Math.random() * yh.length)];
  conn.sendMessage(m.chat, {image: {url: url}, caption:`*•┃❖مرحبا بكم في نيفرلاند❄️〙* ‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌ ‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌ ‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌‌*•┃❖☾•═━═━═⊳•⊰❄️⊱•⊲═━═━═•☽❖*
*⋋❖┋لدخول الي النقابه الدردشه اكتب ( .استماره ) لو البوت مردش منشن لمشرف☾* 

*⋋❖┋يرجى الانتظار حتى تكمل الاجراءات وتدخل النقابه ☾*

*⋋❖┋ممنوع الكلام هنا ☾*

*⋋❖┋ممنوع الرقم الوهمي منعاً باتاً ☾*

*❖┋ملاحظة〗*
*〘 اذا انقضت 24 ساعه ولم تكمل اجراءات الدخول تطرد 〙*

*⋋❖┋القاب اعضاء ☾*
*〘 مملكة نيفرلاند╎𝐍•𝐑•𝐃 〙*

*❖☾•━═━═━═⊳•⊰ أ ⊱•⊲═━═━═━•☽❖*
❖استا❖❄️
❖الكيورا❖❄️
❖اسكانور❖❄️
❖اكازا❖❄️
❖اكيرا❖❄️
❖انتيجرا❖❄️
❖اوبيتو❖❄️
❖اوياجي❖❄️
❖اياناكوجي❖❄️
❖ايبو❖❄️
❖ايتاتشي❖❄️
❖ايروين❖❄️
❖ايرين❖❄️
❖ايزن❖❄️
❖ايما❖❄️
❖اينو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ب ⊱•⊲═━═━═━•☽❖*
❖بوروتو❖❄️
❖بلاك❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ت ⊱•⊲═━═━═━•☽❖*
❖تانجيرو❖❄️
❖تسويوري كاناو❖❄️
❖توجي❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ث ⊱•⊲═━═━═━•☽❖*

❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ج ⊱•⊲═━═━═━•☽❖*
❖جيكسى❖❄️
❖جوترو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ح ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ خ ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ د ⊱•⊲═━═━═━•☽❖*
❖دراكن❖❄️
❖دابي❖❄️
❖ديكو❖❄️
❖دازاي❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ذ ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ر ⊱•⊲═━═━═━•☽❖*
❖رينغيكو❖❄️
❖ران❖❄️
❖ريو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ز ⊱•⊲═━═━═━•☽❖*
❖زورو❖❄️
❖زراكي❖❄️
❖زينتسو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ س ⊱•⊲═━═━═━•☽❖*
❖ساسكي❖❄️
❖سونج جين وو❖❄️
❖سوكونا❖❄️
❖سينكو❖❄️
❖سانجي❖❄️
❖سايتاما❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ش ⊱•⊲═━═━═━•☽❖*
❖شانكس❖❄️
❖شيزوكا❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ص ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ض ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ط ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ظ ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ع ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ غ ⊱•⊲═━═━═━•☽❖*
❖غوجو ساتور❖❄️
❖غوكو❖❄️
❖غوهان❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ف ⊱•⊲═━═━═━•☽❖*
❖فيجيتا❖❄️
*❖☾•━═━═━═⊳•⊰ ق ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ك ⊱•⊲═━═━═━•☽❖*
❖كانيكى❖❄️
❖كايدو❖❄️
❖كايزو كوني❖❄️
❖كرولو❖❄️
❖كوروساكي❖❄️
❖كوروكو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ل ⊱•⊲═━═━═━•☽❖*
❖لوفي❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ م ⊱•⊲═━═━═━•☽❖*
❖مايكي❖❄️
❖ميكاسا❖❄️
❖ميليوداس❖❄️
❖ميغومي❖❄️
❖ميهوك❖❄️
❖ماهيتو❖❄️
❖مادارا❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ن ⊱•⊲═━═━═━•☽❖*
❖ناروتو❖❄️
❖نوبارا❖❄️
❖نويل❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ه‍ ⊱•⊲═━═━═━•☽❖*
❖هيستوريا❖❄️
❖هيروكو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ و ⊱•⊲═━═━═━•☽❖*
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰ ي ⊱•⊲═━═━═━•☽❖*
❖يوتا❖❄️ 
❖ياماتو❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
❖❖❄️
*❖☾•━═━═━═⊳•⊰❄️⊱•⊲═━═━═━•☽❖*
*⋋❖┋مملكه نيفرلاند ترحب بكم ☾*
*❖☾•━═━═━═⊳•⊰❄️⊱•⊲═━═━═━•☽❖*
*⋋❖┋توقيع الإدارة🖋️ ☾*
*〘 مملكه نيفرلاند╎𝐍•𝐑•𝐃 〙*
`}, {quoted: m});
};
handler.command = /^(الالقاب-الماخوذه|القاب|الالقاب)$/i;
handler.tags = [' القاب'];
handler.help = ['ألقاب'];
export default handler;

global.loli = [
'https://telegra.ph/file/084700cf609b61f461fe7.jpg',
  
];