let handler = m => m; 
 handler.all = async function (m) { 

   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if  (/^احاا|احااا|احاااا|احااااا|احاااااا|احااااااا|احا$/i.test(m.text) ) {responses = [ 
       
          `*احتيــن*`, 
         
];
} 

if (/^لوفي تحتاج مساعده$/i.test(m.text) ) { responses = [  
    `*لا حبيبي شكرا*`, 
     `*شكرا لا احتاج ل احد*`, 
      `*لا يشيطاني الصغير*`,

];
}


if (/^وتت$/i.test(m.text) ) { responses = [  
    `*ملـك القـراصـنه*`, 
`@${who.split('@')}`
];
}


   
if (/^لووفي$/i.test(m.text) ) { responses = [  
    `*ملـك القـراصـنه*`, 
         `*عـمك*`, 
  `*عم غوجو*`, 
];
}


   

   if (/^عبيط| باكا |اهبل|غبي$/i.test(m.text) ) { responses = [ 
      `*بـاكـا يـارو بيـبي*`,
       `*شـوف نفسـك*`,
     
];
 }
   
if /^682882$/i.test(m.text) ) { responses = [ 
     `*اسـمي لوفي بـوت بعيـنك*`, 
  `*يبدو ان دماغك معطل هل نصلحه*`, 
      `*ناديني لوفي ياعزيزي*`, 
         `*اسمي لوفي*`, 
        `*بـاكــا اسمي لوفي*`,
  

];
  }
   
   if (/^⑥⑧⑧$/i.test(m.text) ) { responses = [  
    `*اطـلب واتمنى*`, 
     `*ماذا هناك ياعزيزي*`,  
     `*ماذا هناك ياشيطاني الصغير*`, 
     
        `*عيـون ايمـا*`, 
          `*عــيونــها*`, 
        `*لبيـهه يشيطاني*`, 
         `*تفضـل*`, 
        `*قلـبـهاا*`,
        `*حبيب ايـــما*`,
          `*تدلل*`,
        `*شريــان ايمـا*`,
          `*وتيــن ايـما*`,
  ];
  }
    


 if (/^①②②②$/i.test(m.text) ) {responses = [ 
       `*قـول نـعم يـحب*`, 
           `*قـول نعـم*`,
        `*قـول نعـم يــحب*`,
 ];                 
 } 

   

if (/^كيفك$/i.test(m.text) ) { responses = [ 
     '*تمام بخير وانت كيفك حبيبي*',
     `*تمام بخير ياشيطاني الصغيـر*`,
  


];
   }
   
  
  
 if (/^⑧②⑧②⑧$/i.test(m.text) ) { responses = [ 
     `*لاتقول امزح ترا مزحك ثقيل*`, 
     `*تجرح في كلامك ثم تقول بهزر*`,
       `*اش مـن امزح تع المحكـمه*`,
 ]; 
   } 
  
 
   

  
 if (/^تحبني$/i.test(m.text) ) {responses = [ 
         `*احبـك نص بس*`, 
         `*امـوت فيك*`,
          `*لا اكرهــكك*`,
           `*بفـــكر*`,
        `*ان شاء اللــه*`,
        `*احتـرم نفســك*`,
 ]; 
 } 
  
 if (/^%$⑧②$/i.test(m.text) ) { responses = [ 
          `*نـورت يـقلبي*`,
       `*ارجع مـن حيث اتيـت*`,
       `*كنا مرتاحين في غيابك*`,
         `*ليش جيـت اصلا*`,
          `*لاتجـي انقلع*`,
 ];
 } 
  
 if (/^اخرسي|اخرس$/i.test(m.text) ) { responses = [ 
        `*تبي اصـلح دماغك*`, 
         `*اخرس انـت*`,
   `*وميـن انت ع شان تتكلـم معي كذا*`,
          `*احـــمق*`,
 ]; 
 } 
  
 if (/^حرامي$/i.test(m.text) ) { responses = [ 
    `*تتهـم بدون ادله يا احمـق*`, 
  `*كيف عرفت مسوي دور المحقق*`,
   `*بس اسكـت خلي الناس بحـالها*`,
         `*شــووف نفسـك*`,
 ];     
 } 
 
       
   
 
  
 if (/^⑨⑧⑧③⑦$/i.test(m.text) ) { responses = [ 
   `*وعليكم السلام ورحمة الله وبركاته*`, 
        `*عليـكم سلام*`,
   `*وعليكم سلام نورت ياشيطاني الصغير*`,
 ]; 
 } 
  
 if (/^بوت اش اسمك$/i.test(m.text) ) { responses = [ 
        `*اسمي لوفي ياعزيزي*`, 
    
   
  ];
 } 
     
 if (/^🤖$/i.test(m.text) ) { responses = [ 
    `*انت بوت عشان ترسل الملصق ذه*`, 
      
         
];
 } 
     
 if (/^⑧②⑦|🐦‍⬛$/i.test(m.text) ) {responses = [  
     `🐦🐦🐦🐦🐦`, 
     `🐦‍⬛🐦‍⬛🐦‍⬛🐦‍⬛🐦‍⬛ `, 
      
      
];
 } 
  
  

 if (/^⑧⑧⑧⑧$/i.test(m.text) ) { responses = [ 
      `*الـحمدلله بخيـر دامك بخير*`,
        `*دامك بخير لاتسئل*`, 
          `*مثل حـالك*`,
      `*الحمدلله على كل حـال*`,
 ];
   }
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 

 export default handler;